# Q-9. Given the score of students in multiple exams
Test the hypothesis that the mean scores of all the students are the same. If not, name the student with the highest score.

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("marks.csv")

In [3]:
df.head()

      Name  Exam 1  Exam 2  Final Exam
0    Karan      85      90          92
1    Deepa      70      80          85
2  Karthik      90      85          88
3  Chandan      75      70          75
4   Jeevan      95      92          96

In [4]:
df.describe()

          Exam 1     Exam 2  Final Exam
count   5.000000   5.000000    5.000000
mean   83.000000  83.400000   87.200000
std    10.368221   8.820431    7.981228
min    70.000000  70.000000   75.000000
25%    75.000000  80.000000   85.000000
50%    85.000000  85.000000   88.000000
75%    90.000000  90.000000   92.000000
max    95.000000  92.000000   96.000000

In [5]:
exam1 = df["Exam 1"]
exam2 = df["Exam 2"]
final_exam = df["Final Exam"]

In [6]:
from scipy import stats
from scipy.stats import f_oneway

# Null hypothesis: Two or more groups have the same population mean.

f_statistic, p_value = f_oneway(exam1, exam2, final_exam)

if p_value < 0.05:
    print("Reject the null hypothesis.")
else:
    print("Fail to reject the null hypothesis.")
    print("3 samples have identical mean values")

Fail to reject the null hypothesis.
3 samples have identical mean values